cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# Java is a requirement for android-sdk
cask 'java'

# Install formulas
brew 'ack'
brew 'ansible'
brew 'bash'
brew 'coreutils'
brew 'git'
brew 'gradle'
brew 'grc'                    # Generic colouriser (http://korpus.juls.savba.sk/~garabik/software/grc.html)
brew 'heroku-toolbelt'
brew 'hub'
brew 'mas'
brew 'mysql'
brew 'node'
brew 'rbenv'
brew 'redis'
brew 'ruby-build'
brew 'tree'
brew 'wget'
brew 'youtube-dl'

cask '1password'
cask 'adapter'                # Video, audio, image converter (http://www.macroplant.com/adapter/)
cask 'atom'
cask 'awareness'              # Awareness of time spent on computer (http://iamfutureproof.com/tools/awareness/)
cask 'base'                   # SQLite DB inspector
cask 'caffeine'
cask 'charles'
cask 'cinch'
cask 'cleanmymac'
cask 'colorpicker-developer'
cask 'colorpicker-skalacolor' # From Bjango
cask 'commandq'
cask 'dash'
cask 'firefox'
cask 'flux'
cask 'gas-mask'               # Edit host file
cask 'github-desktop'
cask 'google-chrome'
cask 'google-drive'
cask 'google-hangouts'
cask 'handbrake'
cask 'hipchat'
cask 'intellij-idea-ce'
cask 'imagealpha'
cask 'imageoptim'
cask 'iterm2'
cask 'keyboardcleantool'      # Block keyboard input to allow cleaning (http://blog.boastr.net/keyboardcleantool/)
cask 'keycastr'               # Keystroke visualiser (https://github.com/keycastr/keycastr)
cask 'launchbar'
cask 'licecap'                # Simple animated screen recording (http://www.cockos.com/licecap/)
cask 'macvim'
cask 'noun-project'           # Find and use icons easily (https://thenounproject.com/for-mac/)
cask 'numi'                   # Beautiful calculator (http://numi.io)
cask 'openemu'                # Multi-platform emulator (http://openemu.org)
cask 'osxfuse'                # FUSE filesystem creator (https://osxfuse.github.io)
cask 'pikopixel'              # Pixel art editor (http://twilightedge.com/mac/pikopixel/)
cask 'plex-media-server'
cask 'postgres'
cask 'postico'                # PostgreSQL GUI (https://eggerapps.at/postico/)
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'recordit'               # Quick and free screencasts (http://recordit.co)
cask 'sabnzbd'
cask 'slack'
cask 'sequel-pro'
cask 'sidestep'               # Background traffic securing (http://chetansurpur.com/projects/sidestep/)
cask 'sizeup'
cask 'sketch'
cask 'skitch'
cask 'sonarr' 		      # SickBeard alternative
cask 'spotify'
cask 'sonos'
cask 'sublime-text'
cask 'the-unarchiver'
cask 'transmit'
cask 'transmission'
cask 'tunnelbear'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
cask 'xld'

mas 'bear', 	  id: 1091189122
mas 'spark', 	  id: 1176895641
mas 'wunderlist', id: 410628904
